app/controllers/activities_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "activities" ("hostid", "activityType", "location", "groupSize", "comments", "duration", "longitude", "latitude", "startTime", "memberNum", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
UPDATE "activities" SET "memberNum" = $1, "updated_at" = $2 WHERE "activities"."id" = $3  [["memberNum", 1], ["updated_at", "2015-11-09 06:14:20.662354"], ["id", 2]]
INSERT INTO "memberactivities" ("user_id", "activity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["activity_id", 2], ["created_at", "2015-11-09 06:14:20.684828"], ["updated_at", "2015-11-09 06:14:20.684828"]]
---
  def post
  	if checkAuth(params)
  		@user = User.find_by(id: params[:HostID])
  		a = @user.activities.new(activity_params)
	    if @user and a.save
		    a.memberactivities.create(user_id: params[:HostID], activity_id: a.id)

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1  ORDER BY "activities"."created_at" DESC LIMIT 1  [["id", 2]]
UPDATE "activities" SET "memberNum" = $1, "updated_at" = $2 WHERE "activities"."id" = $3  [["memberNum", 1], ["updated_at", "2015-11-09 06:14:20.662354"], ["id", 2]]
INSERT INTO "memberactivities" ("user_id", "activity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["activity_id", 2], ["created_at", "2015-11-09 06:07:12.558471"], ["updated_at", "2015-11-09 06:07:12.558471"]]
---
  def join
  	if checkAuth(params)
  		a = Activity.find_by(id: params[:ActID])
	    a.update(member_number: a.member_number + 1)
	    a.memberactivities.create(user_id: params[:UserID], activity_id: params[:ActID])

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1  ORDER BY "activities"."created_at" DESC LIMIT 1  [["id", 2]]
SELECT  "memberactivities".* FROM "memberactivities" WHERE "memberactivities"."activity_id" = $1 AND "memberactivities"."user_id" = $2 LIMIT 1  [["activity_id", 2], ["user_id", 1]]
DELETE FROM "memberactivities" WHERE "memberactivities"."id" = $1  [["id", 1]]
---
	def drop
		if checkAuth(params)
  		a = Activity.find_by(id: params[:ActID])
			relation = a.memberactivities.find_by(user_id: params[:UserID])
			relation.delete

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1  ORDER BY "activities"."created_at" DESC LIMIT 1  [["id", 1]]
SELECT "memberactivities".* FROM "memberactivities" WHERE "memberactivities"."activity_id" = $1  [["activity_id", 3]]
---
	def getsingle
		if checkAuth(params)
  		a = Activity.find_by(id: params[:actId])
			members = []

			a.memberactivities.each do |ma|