app/controllers/users_controller.rb

  def create
    if params[:mode] == "fb"
      @graph = Koala::Facebook::API.new(params[:fbToken])
      profile = @graph.get_object("me")
		  @user = User.new(user_params_fb(profile))
    else
      @user = User.new(user_params)
    end

		if @user.save
---
INSERT INTO "users" ("name", "email", "gender", "authtoken", "password_salt", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def resetpw
		user = User.find_by(email: params[:email])
		if !user.nil?
			if Time.now - user.validation_time < 60*60
				validation_code = params[:validation_code]

		    	if validation_code == user.validation_code
			    	rtn = {
			  			status: "201"
			  		}
					render :json => rtn
					psw_token = BCrypt::Engine.hash_secret(params[:new_password], user.password_salt)
					user.update(password_digest: psw_token)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "yxi5@jhu.edu"]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$w2QXn8.nAf8MlXzV.Ey02O/E5QzZjCXJcQ9SqHYT34WJL4gEyqudC"], ["updated_at", "2015-11-25 05:05:30.569193"], ["id", 1]]

	def signin
		rtn = {
	  	status: "401"
	  }
    if params && params[:email] && params[:password]
      user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE (email ='libowensta@gmail.com')  ORDER BY "users"."id" ASC LIMIT 1

  def forgetpw
	user = User.find_by(email: params[:email])
	# print params[:email]
	# UserMailer.forget_password_confirmation(@user).deliver
	if !user.nil?

   	 	validation_code = rand_string(6)
    	validation_time = Time.now

    	user.update(validation_code: validation_code)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "yxi5@jhu.edu"]]
UPDATE "users" SET "password_salt" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_salt", "$2a$10$1UsfpiOTztrvi7UIZrGqFO"], ["password_digest", "$2a$10$1UsfpiOTztrvi7UIZrGqFO4r9AhV0KgqaQM.iY20/ujvhirmOIa2a"], ["updated_at", "2015-11-25 03:33:59.364307"], ["id", 1]]

  def fblogin
    @graph = Koala::Facebook::API.new(params[:fbToken])
    profile = @graph.get_object("me")
    print "~~~~~~~~~~~~~~~~~~~~~~"
    print profile
    print "~~~~~~~~~~~~~~~~~~~~~~"
    user = User.find_by(email: params[:email])
    if user.nil?
      @user = User.new(user_params_fb(profile))
      if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "libowensta@gmail.com"]]
INSERT INTO "users" ("name", "email", "gender", "authtoken", "password_salt", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"